use super::LCTime;

const TIME_RU_RU: LCTime = LCTime {
  d_t_fmt: "%a %d %b %Y %T",
  d_fmt: "%d.%m.%Y",
  t_fmt: "%T",
  t_fmt_ampm: "",
  am_str: "",
  pm_str: "",
  day: [
    "Воскресенье",
    "Понедельник",
    "Вторник",
    "Среда",
    "Четверг",
    "Пятница",
    "Суббота"
  ],
  abday: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
  mon: [
    "января",
    "февраля",
    "марта",
    "апреля",
    "мая",
    "июня",
    "июля",
    "августа",
    "сентября",
    "октября",
    "ноября",
    "декабря"
  ],
  abmon: [
    "янв", "фев", "мар", "апр", "мая", "июн", "июл", "авг", "сен", "окт",
    "ноя", "дек"
  ]
};
